Revit 2026 API

# ExporterIFCSetOwnerHistoryHandle Method

---

Sets the handle to the IfcOwnerHistory for the file.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOwnerHistoryHandle(
	IFCAnyHandle ownerHistory
)
```
```vb
Public Sub SetOwnerHistoryHandle (
	ownerHistory As IFCAnyHandle
)
```
```cpp
public:
void SetOwnerHistoryHandle(
	IFCAnyHandle^ ownerHistory
)
```
```fsharp
member SetOwnerHistoryHandle :
        ownerHistory : IFCAnyHandle -> unit
```

#### Parameters

ownerHistory IFCAnyHandle
     The handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace